tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "rcmdnk/file"
tap "universal-ctags/universal-ctags"
brew "bash-completion"
brew "ccat"
brew "ctags", link: false
brew "git"
brew "gnu-sed"
brew "grip"
brew "highlight"
brew "htop"
brew "jq"
brew "mas"
brew "neovim"
brew "openssl@1.1"
brew "readline"
brew "python"
brew "python@2"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "unar"
brew "vim"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "rcmdnk/file/brew-file"
cask "alacritty"
cask "firefox"
cask "font-hasklig"
cask "font-hasklig-nerd-font"
cask "font-hasklig-nerd-font-mono"
cask "google-chrome"
cask "moom"
cask "slack"
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
