tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "rcmdnk/file"
tap "universal-ctags/universal-ctags"
brew "bash-completion"
brew "ccat"
brew "ctags", link: false
brew "elixir"
brew "git"
brew "gnu-sed"
brew "grip"
brew "haskell-stack"
brew "highlight"
brew "htop"
brew "jq"
brew "mas"
brew "mysql@5.7", restart_service: true
brew "neovim"
brew "openssl@1.1"
brew "pandoc"
brew "readline"
brew "postgresql"
brew "python"
brew "python@2"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "tmux"
brew "tree"
brew "unar"
brew "vim"
brew "watchman"
brew "yarn"
brew "z"
brew "zsh"
brew "zsh-completions"
brew "rcmdnk/file/brew-file"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "alacritty"
cask "alfred"
cask "firefox"
cask "font-hasklig"
cask "font-hasklig-nerd-font"
cask "font-hasklig-nerd-font-mono"
cask "google-chrome"
cask "iterm2"
cask "karabiner"
cask "karabiner-elements"
cask "moom"
cask "ngrok"
cask "sequel-pro"
cask "slack"
mas "Cleaner-App", id: 1013897218
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Moom", id: 419330170
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Quiver", id: 866773894
mas "Wunderlist", id: 410628904
mas "Xcode", id: 497799835
